app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Math"], ["room_number", 3]]
---
    def create
        @school_class = SchoolClass.new(school_class_params)
        @school_class.save

UPDATE "school_classes" SET "room_number" = ? WHERE "school_classes"."id" = ?  [["room_number", 5], ["id", 1]]
---
    def update
        school_class_find_by_id
        @school_class.update(school_class_params)