app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Luciana"], ["last_name", "Sugeta"], ["created_at", "2021-06-27 16:02:23.461477"], ["updated_at", "2021-06-27 16:02:23.461477"]]
---
    def create
        @student = Student.new(student_params)
        @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        @student = Student.find_by_id(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def edit
        @student = Student.find_by_id(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Takai  Oikawa"], ["updated_at", "2021-06-27 16:15:36.961724"], ["id", 4]]
---
    def update
        @student = Student.find_by_id(params[:id])
        @student.update(student_params)